oriflame/src/test/resources/pior.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <INBOUND_ORDER_RECEIPT xmlns="urn:ifsworld-com:schemas:post_inbound_order_receipt">
            <DATE_CREATED>2012-12-03T00:00:00.000+00:00</DATE_CREATED>
            <DELIVERY_DATE>2012-12-05T00:00:00.000+00:00</DELIVERY_DATE>
            <GLN_RECEIVER>1234567890</GLN_RECEIVER>
            <GLN_SENDER>9876543210</GLN_SENDER>
            <INBOUND_COMPLETE>0</INBOUND_COMPLETE>
            <ORDER_NO>29325</ORDER_NO>
            <ORDER_TYPE>PURCHASEORDER</ORDER_TYPE>
            <SITE>DCBUD</SITE>
            <VENDOR_NO>WDPLE</VENDOR_NO>
            <INBOUND_ORDER_RECEIPT_PALLETS>
                <INBOUND_ORDER_RECEIPT_PALLET>
                    <BPP>30.0</BPP>
                    <PALLET_ID>P12345</PALLET_ID>
                    <UPP>4.0</UPP>
                    <INBOUND_ORDER_RECEIPT_LINES>
                        <INBOUND_ORDER_RECEIPT_LINE>
                            <BOX_ID>1234567890</BOX_ID>
                            <BOX_SIZE>24.0</BOX_SIZE>
                            <BOX_WEIGHT>9.53</BOX_WEIGHT>
                            <COUNTRY_OF_FILLING>HU</COUNTRY_OF_FILLING>
                            <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                            <CUSTOMS_STAT_NO>691200900000</CUSTOMS_STAT_NO>
                            <DELNOTE_NO>130735</DELNOTE_NO>
                            <DIMENSIONS>0.56x0.34x0.28</DIMENSIONS>
                            <EXPIRY_DATE>2032-12-03T00:00:00.000+01:00</EXPIRY_DATE>
                            <GTIN>1234567890</GTIN>
                            <LOCATION_NO>O</LOCATION_NO>
                            <PART_NO>25457.1</PART_NO>
                            <PRODUCTION_DATE>1211-08-11T00:00:00.000+01:00</PRODUCTION_DATE>
                            <QUANTITY>96.0</QUANTITY>
                            <REMARKS>C06694</REMARKS>
                            <SEQUENCE_NO>76.0</SEQUENCE_NO>
                        </INBOUND_ORDER_RECEIPT_LINE>
                    </INBOUND_ORDER_RECEIPT_LINES>
                </INBOUND_ORDER_RECEIPT_PALLET>
            </INBOUND_ORDER_RECEIPT_PALLETS>
        </INBOUND_ORDER_RECEIPT>
    </soap:Body>
</soap:Envelope>